In [1]:
%config Completer.use_jedi = False

In [7]:
import pandas as pd
import numpy as np
import seaborn as sns

/Users/sanghyub/anaconda/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)
/Users/sanghyub/anaconda/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [5]:
# 1. 랜덤 샘플을 생성하자.
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
display(ser)

# 2. 내부적으로 선언된 집계 함수를 사용하자.
display(ser.sum())
display(ser.mean())

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

2.811925491708157

0.5623850983416314

In [6]:
# 1. 랜덤 샘플을 생성하자.
df = pd.DataFrame({'A': rng.rand(5),'B': rng.rand(5)})
display(df)

# 2. 내부적으로 선언된 집계 함수를 사용하자. 각 컬럼에 대한 평균값을 반환한다. 디폴트값이다.
display(df.mean())

# 3. 각 row에 대한 평균을 내보자.
display(df.mean(axis='columns'))

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

A    0.477888
B    0.443420
dtype: float64

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [8]:
planets = sns.load_dataset('planets')

In [10]:
display(planets.shape)
display(planets.head)

(1035, 6)

<bound method NDFrame.head of                method  number  orbital_period    mass  distance  year
0     Radial Velocity       1      269.300000   7.100     77.40  2006
1     Radial Velocity       1      874.774000   2.210     56.95  2008
2     Radial Velocity       1      763.000000   2.600     19.84  2011
3     Radial Velocity       1      326.030000  19.400    110.62  2007
4     Radial Velocity       1      516.220000  10.500    119.47  2009
5     Radial Velocity       1      185.840000   4.800     76.39  2008
6     Radial Velocity       1     1773.400000   4.640     18.15  2002
7     Radial Velocity       1      798.500000     NaN     21.41  1996
8     Radial Velocity       1      993.300000  10.300     73.10  2008
9     Radial Velocity       2      452.800000   1.990     74.79  2010
10    Radial Velocity       2      883.000000   0.860     74.79  2010
11    Radial Velocity       1      335.100000   9.880     39.43  2009
12    Radial Velocity       1      479.100000   3.880     97.28  2008
13    Radial Velocity       3     1078.000000   2.530     14.08  1996
14    Radial Velocity       3     2391.000000   0.540     14.08  2001
15    Radial Velocity       3    14002.000000   1.640     14.08  2009
16    Radial Velocity       1        4.230785   0.472     15.36  1995
17    Radial Velocity       5       14.651000   0.800     12.53  1996
18    Radial Velocity       5       44.380000   0.165     12.53  2004
19    Radial Velocity       5     4909.000000   3.530     12.53  2002
20    Radial Velocity       5        0.736540     NaN     12.53  2011
21    Radial Velocity       5      261.200000   0.172     12.53  2007
22    Radial Velocity       3        4.215000   0.016      8.52  2009
23    Radial Velocity       3       38.021000   0.057      8.52  2009
24    Radial Velocity       3      123.010000   0.072      8.52  2009
25    Radial Velocity       1      116.688400     NaN     18.11  1996
26    Radial Velocity       1      691.900000     NaN     81.50  2012
27    Radial Velocity       1      952.700000   5.300     97.18  2008
28    Radial Velocity       1      181.400000   3.200     45.52  2013
29            Imaging       1             NaN     NaN     45.52  2005
...               ...     ...             ...     ...       ...   ...
1005          Transit       1        3.693641     NaN    200.00  2012
1006          Transit       1        4.465633     NaN    330.00  2012
1007          Transit       1        4.617101     NaN    255.00  2012
1008          Transit       1        2.838971     NaN    455.00  2012
1009          Transit       1        5.017180     NaN    300.00  2012
1010          Transit       1        7.919585     NaN    125.00  2012
1011          Transit       1        4.305001     NaN    400.00  2012
1012          Transit       1        3.855900     NaN    480.00  2012
1013          Transit       1        4.411953     NaN    160.00  2012
1014          Transit       1        4.378090     NaN    330.00  2012
1015          Transit       1        1.573292     NaN    350.00  2012
1016          Transit       1        2.311424     NaN    310.00  2013
1017          Transit       1        4.086052     NaN    380.00  2012
1018          Transit       1        4.614420     NaN    225.00  2012
1019          Transit       1        2.903675     NaN    345.00  2012
1020          Transit       1        2.216742     NaN    340.00  2012
1021          Transit       1        2.484193     NaN    260.00  2013
1022          Transit       1        1.360031     NaN     93.00  2012
1023          Transit       1        2.175176     NaN    550.00  2012
1024          Transit       1        3.662387     NaN    240.00  2012
1025          Transit       1        3.067850     NaN     60.00  2012
1026          Transit       1        0.925542     NaN    470.00  2014
1027          Imaging       1             NaN     NaN     19.20  2011
1028          Transit       1        3.352057     NaN   3200.00  2012
1029          Imaging       1             NaN     NaN     10.10  2012
1030          Transit       1        3.941507     NaN    172.00  2006
1031          Transit       1        2.615864     NaN    148.00  2007
1032          Transit       1        3.191524     NaN    174.00  2007
1033          Transit       1        4.125083     NaN    293.00  2008
1034          Transit       1        4.187757     NaN    260.00  2008

[1035 rows x 6 columns]>

In [12]:
#간단한 EDA, 쓸 수 있는 칼럼, null값 이상치 확인
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [15]:
len(planets)

1035

In [13]:
planets.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

### GroupBY

In [16]:
# 1. DataFrame을 생성한다.
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'], 
                   'data': range(6)},
                 columns = ['key', 'data']) # 명확하게 표현하는 것 필요!

display(df)

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [18]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

> __GroupBy 객체__

In [19]:
planets.groupby('method').median()

                               number  orbital_period   mass  distance    year
method
Astrometry                        1.0      631.180000    NaN    17.875  2011.5
Eclipse Timing Variations         2.0     4343.500000  5.125   315.360  2010.0
Imaging                           1.0    27500.000000    NaN    40.395  2009.0
Microlensing                      1.0     3300.000000    NaN  3840.000  2010.0
Orbital Brightness Modulation     2.0        0.342887    NaN  1180.000  2011.0
Pulsar Timing                     3.0       66.541900    NaN  1200.000  1994.0
Pulsation Timing Variations       1.0     1170.000000    NaN       NaN  2007.0
Radial Velocity                   1.0      360.200000  1.260    40.445  2009.0
Transit                           1.0        5.714932  1.470   341.000  2012.0
Transit Timing Variations         2.0       57.011000    NaN   855.000  2012.5

In [21]:
#check
planets[planets.method == 'Astrometry']

         method  number  orbital_period  mass  distance  year
113  Astrometry       1          246.36   NaN     20.77  2013
537  Astrometry       1         1016.00   NaN     14.98  2010

In [23]:
# 2. 'orbital_period' column을 선택
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [25]:
# 3. GroupBy 객체는 그룹을 직접 순회할 수 있다.
# 각 메서드에 대하여 속하는 그룹을 리턴한다.
for (method, group) in planets.groupby('method'):
    print('{0:30s} shape={1}'.format(method, group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

In [28]:
# 4. 각 group을 설명하는 일련의 집계 연산을 수행할 수 있다.
# groupby 후, year 컬럼에 대해서 일련의 집계 연산을 수행하는 메소드.
# 멀티인덱스를 row, col으로 나누어주거나, row, col을 합쳐서 멀티 인덱스를 만들어준다.
# 각 columns 값이 정리되어 나옴
# 사용하거나 말거나
planets.groupby('method')['year'].describe().unstack()

       method
count  Astrometry                          2.000000
       Eclipse Timing Variations           9.000000
       Imaging                            38.000000
       Microlensing                       23.000000
       Orbital Brightness Modulation       3.000000
       Pulsar Timing                       5.000000
       Pulsation Timing Variations         1.000000
       Radial Velocity                   553.000000
       Transit                           397.000000
       Transit Timing Variations           4.000000
mean   Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.131579
       Microlensing                     2009.782609
       Orbital Brightness Modulation    2011.666667
       Pulsar Timing                    1998.400000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2007.518987
       Transit                          2011.236776
       Transit Timing Variations        2012.500000
std    Astrometry                          2.121320
       Eclipse Timing Variations           1.414214
       Imaging                             2.781901
       Microlensing                        2.859697
       Orbital Brightness Modulation       1.154701
       Pulsar Timing                       8.384510
       Pulsation Timing Variations              NaN
       Radial Velocity                     4.249052
       Transit                             2.077867
       Transit Timing Variations           1.290994
                                           ...
50%    Astrometry                       2011.500000
       Eclipse Timing Variations        2010.000000
       Imaging                          2009.000000
       Microlensing                     2010.000000
       Orbital Brightness Modulation    2011.000000
       Pulsar Timing                    1994.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2009.000000
       Transit                          2012.000000
       Transit Timing Variations        2012.500000
75%    Astrometry                       2012.250000
       Eclipse Timing Variations        2011.000000
       Imaging                          2011.000000
       Microlensing                     2012.000000
       Orbital Brightness Modulation    2012.000000
       Pulsar Timing                    2003.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2011.000000
       Transit                          2013.000000
       Transit Timing Variations        2013.250000
max    Astrometry                       2013.000000
       Eclipse Timing Variations        2012.000000
       Imaging                          2013.000000
       Microlensing                     2013.000000
       Orbital Brightness Modulation    2013.000000
       Pulsar Timing                    2011.000000
       Pulsation Timing Variations      2007.000000
       Radial Velocity                  2014.000000
       Transit                          2014.000000
       Transit Timing Variations        2014.000000
Length: 80, dtype: float64

> 집계, 필터, 변환, 적용

In [29]:
# 랜덤으로 DataFrame을 생성한다.
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'data1': range(6),
                  'data2': rng.randint(0, 10, 6),},
                 columns = ['key', 'data1', 'data2'])

df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [30]:
"""집계 : aggregate()""" 

# 1) 직접 함수를 리스트의 원소로 넣어도 되고, 문자열로 넣어도 된다.
# data1/data2 에 동시에 적용
display(df.groupby('key').aggregate(['min', np.median, max]))

# 2) 딕셔너리를 전달하는 경우. data에 대해서 각각 지정이 가능
display(df.groupby('key').aggregate(
        {'data1': [min, np.mean], 'data2': 'max'}))

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

    data1      data2
      min mean   max
key
A       0  1.5     5
B       1  2.5     7
C       2  3.5     9

In [32]:
# 내장 함수만 str으로 사용가능
df.groupby('key').aggregate(['min', np.mean, max])

    data1          data2
      min mean max   min mean max
key
A       0  1.5   3     3  4.0   5
B       1  2.5   4     0  3.5   7
C       2  3.5   5     3  6.0   9

In [34]:
#세부 데이터에 접근, iloc을 사용
df.groupby('key').aggregate(['min',np.median,'max'])['data1'].iloc[0]

min       0.0
median    1.5
max       3.0
Name: A, dtype: float64

#### filter

In [35]:
"""필터링 : filter(), 그룹 속성을 기준으로 데이터를 걸러낼 수 있다."""

# std가 4보다 큰 그룹을 filter 한다.
def filter_func(x):
    return x['data2'].std() > 4

display(df)
display(df.groupby('key').std())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [36]:
# 그룹 B, C에 속한 데이터만 return 할 것이다. filter 함수는 부울 값을 반환한다.
display(df.groupby('key').filter(filter_func))
display(df.groupby('key').filter(lambda x: x['data2'].std() > 4))

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [37]:
"""변환 : trnasformation"""

display(df)

# 그룹에 따른 평균을 구한다. 
# 즉 그룹 A의 data1, data2의 평균을 각각 구하고 데이터에서 평균을 뺀다.
# 정규화에 사용되면 좋을 것이다.
display(df.groupby('key').transform(lambda x: x - x.mean()))

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [38]:
"""apply - 임의의 함수를 그룹 결과에 적용할 때 사용"""

# 같은 그룹에 속하는 data2의 합으로 data1의 값을 각각 나눈다.
def norm_by_data2(x):
    # x는 그룹 값을 가지는 DataFrame
    x['data1'] /= x['data2'].sum()
    return x

display(df)
display(df.groupby('key').apply(norm_by_data2))
#data1만 normalizing

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

In [39]:
def norb_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x

In [40]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

>__분할 Key를 따로 지정__  
>* 하나의 열 이름을 기준으로 DataFrame을 분할하였는데, 분할키를 지정하는 방식을 살펴보자

In [48]:
# 1. 분할키를 리스트로 지정한다.
L = [0, 1, 0, 1, 2, 0]
display(df)

# 0 - index 0, 2, 5 원소의 sum
# 1 - index 1, 3 원소의 sum
# 2 - index 4 원소의 sum
display(df.groupby(L).sum())

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

   data1  data2
0      7     17
1      4      3
2      4      7

In [49]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [52]:
df.groupby(L).sum()

   data1  data2
0      7     17
1      4      3
2      4      7

In [53]:
# 2. 분할키를 컬럼이름이 아닌 DataFrame을 직접 줄 수도 있다.
df.groupby(df['key']).sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [54]:
# 3. 인덱스 값을 그룹 키에 매핑하는 딕셔너리를 제공
# 키를 지정한다.
df2 = df.set_index('key')
display(df2)

# A는 vowel로 매핑되고, B, C는 consonant로 묶여서 매핑된다.
# key 그룹을 임의로 바꿀 수 있음
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}

display(df2.groupby(mapping).sum())

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

           data1  data2
consonant     12     19
vowel          3      8

In [55]:
# 4. 파이썬 함수를 전달한다.
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

>__분류(Grouping) 문제__

In [60]:
# year를 10으로 나눈다 : 세기를 정하려는 것.
decade = 10 * (planets['year'] // 10)
# decade의 이름
decade = decade.astype(str) + 's'
planets['decade'] = decade

# decade의 name key에 접근
decade.name = 'decade'

In [62]:
planets.head()

            method  number  orbital_period   mass  distance  year decade
0  Radial Velocity       1         269.300   7.10     77.40  2006  2000s
1  Radial Velocity       1         874.774   2.21     56.95  2008  2000s
2  Radial Velocity       1         763.000   2.60     19.84  2011  2010s
3  Radial Velocity       1         326.030  19.40    110.62  2007  2000s
4  Radial Velocity       1         516.220  10.50    119.47  2009  2000s

In [67]:
decade.head()

0    2000s
1    2000s
2    2010s
3    2000s
4    2000s
Name: decade, dtype: object

In [58]:
# 각 연도구간별로 행성이 발견된 횟수를 구할 수 있다.
display(planets.groupby(['method', decade])['number'].sum())

method                         decade
Astrometry                     2010s       2
Eclipse Timing Variations      2000s       5
                               2010s      10
Imaging                        2000s      29
                               2010s      21
Microlensing                   2000s      12
                               2010s      15
Orbital Brightness Modulation  2010s       5
Pulsar Timing                  1990s       9
                               2000s       1
                               2010s       1
Pulsation Timing Variations    2000s       1
Radial Velocity                1980s       1
                               1990s      52
                               2000s     475
                               2010s     424
Transit                        2000s      64
                               2010s     712
Transit Timing Variations      2010s       9
Name: number, dtype: int64

In [59]:
display(planets.groupby(['method', decade])['number'].sum().unstack().fillna(0))

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

### Pivot Table

In [68]:
titanic = sns.load_dataset('titanic')

# 2. 타이타닉 데이터의 샘플을 보자.
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [71]:
#mean을 하게 되면 생존률
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [72]:
# 4. 성별과 좌석 등급별 생존율을 GroupBy 연산을 사용하여 구해보자.
# 좀 더 보기 편하게 unstack, 근데 이게 편한건가?
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [73]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [74]:
# 5. 피벗 테이블을 사용하여 4번에서 구했던 내용을 간단하게 구해보자.
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

> __다단계 피벗 테이블__

In [76]:
# 1. 연령을 추가하여 성별, 좌석 등급, 연령의 3차원으로 보자. 연령은 2개의 구간으로 나누었다.
age = pd.cut(titanic['age'], [0, 18, 80])

# 3차원 테이블이다.
display(titanic.pivot_table('survived', ['sex', age], 'class'))

# sum
display(titanic.pivot_table('survived', 
                            ['sex', age], # index
                            'class', # column
                            aggfunc=np.sum))

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

class            First  Second  Third
sex    age
female (0, 18]      10      14     22
       (18, 80]     72      54     25
male   (0, 18]       4       9     11
       (18, 80]     36       6     27

In [77]:
#segmentation
age = pd.cut(titanic['age'], [0,18,80])
age.head()

0    (18, 80]
1    (18, 80]
2    (18, 80]
3    (18, 80]
4    (18, 80]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 80]]

In [85]:
titanic.pivot_table('survived', ['sex',age], 'class', aggfunc=np.mean)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [86]:
# 2. 열 기준으로 동작할 때는 pd.qcut 함수를 사용한다. 임의로 2개로 나누었다?
# number of quantiles median을 기준으로 나눈 것
fare = pd.qcut(titanic['fare'], 2)

# 4차원 테이블이다.
titanic.pivot_table('survived', 
                    ['sex', age], # index
                    [fare, 'class']) # column
#시작은 포함하지 않기 때문에 fare에 -0.001이 등장한 것

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 80]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 80]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 80]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 80]  0.030303  0.192308

In [87]:
titanic.fare.min()

0.0

> __기타 피벗 테이블 옵션__

In [88]:
# 1. aggfunc 옵션
titanic.pivot_table(index='sex', columns='class',
                    aggfunc={'survived': sum, 'fare': 'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

In [89]:
# 2. 그룹별 총합을 계산하는 옵션
titanic.pivot_table('survived', 
                    index='sex', 
                    columns='class', 
                    margins=True) # default : mean

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

## 벡터화된 문자열 연산
#### Pandas 문자열 연산
* Pandas는 문자열을 담고 있는 Pandas Series와 Index 객체의 str 속성을 통해 벡터화된 문자열 연산을 수행하고 누락된 데이터를 올바르게 처리하기 위한 기능을 제공

> #### 전처리!!!

In [90]:
# 1. 테스트를 위한 데이터 세트 생성
data = ['peter', 'Paul', None, 'MARY', 'gUIDO']
names = pd.Series(data)

names

0    peter
1     Paul
2     None
3     MARY
4    gUIDO
dtype: object

In [91]:
# 2. 누락된 값은 건너뛰면서 모든 항목의 첫 글자를 대문자로 변경하는 메소드를 호출
names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [92]:
#마스킹 할때 자주 사용
names.str.isdigit()

0    False
1    False
2     None
3    False
4    False
dtype: object

In [93]:
# 테스트를 위한 데이터 세트 생성
monte = pd.Series(['Graham Chapman', 'John Cleese', 'Terry Gilliam',
                  'Eric Idle', 'Terry Jones', 'Michael Palin'])

In [94]:
"""lower()"""

monte.str.lower()

0    graham chapman
1       john cleese
2     terry gilliam
3         eric idle
4       terry jones
5     michael palin
dtype: object

In [95]:
"""len()"""

monte.str.len()

0    14
1    11
2    13
3     9
4    11
5    13
dtype: int64

In [96]:
"""startswith()"""

monte.str.startswith('T')

0    False
1    False
2     True
3    False
4     True
5    False
dtype: bool

In [97]:
"""split()"""

display(monte.str.split())
display(monte.str.split().str.get(-1))

0    [Graham, Chapman]
1       [John, Cleese]
2     [Terry, Gilliam]
3         [Eric, Idle]
4       [Terry, Jones]
5     [Michael, Palin]
dtype: object

0    Chapman
1     Cleese
2    Gilliam
3       Idle
4      Jones
5      Palin
dtype: object

In [98]:
"""슬라이싱"""

monte.str[0:3]

0    Gra
1    Joh
2    Ter
3    Eri
4    Ter
5    Mic
dtype: object

> **정규 표현식을 활용하는 메서드**

In [99]:
# 각 요소의 시작 문자와 붙어 있는 그룹을 요청해 각 요소로부터 이름 부분을 추출
monte.str.extract('([A-Za-z]+)')

         0
0   Graham
1     John
2    Terry
3     Eric
4    Terry
5  Michael

In [100]:
# 문자열 시작(^)과 문자열 끝($)을 나타내는 정규 표현식을 사용해 자음으로 시작하고 끝나는 모든 이름을 찾아보자.
monte.str.findall(r'^[^AEIOU].*[^aeiou]$')

0    [Graham Chapman]
1                  []
2     [Terry Gilliam]
3                  []
4       [Terry Jones]
5     [Michael Palin]
dtype: object

### 파이썬에서의 날짜와 시간
* 기본 파이썬 날짜와 시간: datetime, dateutil

In [101]:
from datetime import datetime
datetime(year=2018, month=2, day=4)

datetime.datetime(2018, 2, 4, 0, 0)

In [102]:
# 날짜를 해석할 수 있다.
from dateutil import parser
date = parser.parse("4th of July, 2015")

date

datetime.datetime(2015, 7, 4, 0, 0)

In [103]:
# 요일을 출력하는 작업
date.strftime('%A')

'Saturday'

In [105]:
date.day

4

In [106]:
date.hour

0

### 타입이 지정된 시간 배열: NuPy의 datetime64(Advanced)
* 64비트 정밀도에 제한되기 때문에 이 유형의 연산이 파이썬의 datetime 객체로 직접 작업하는 것보다 훨씬 더 빨리 수행될 수 있다.
시간 부해능과 최대 시간 사이의 절충점을 도입한다.

## 고성능 Pandas: eval()과 query() (속도 느릴 수 있음)
* NumPy의 벡터화/브로드캐스팅된 연산과 Pandas의 그룹화 유형의 연산은 일반적인 경우에 대체로 효율적이고 효과적이기는 하지만 임시 중간 객체 생성에 의존하는 경우가 종종 있어 계산 시관과 메모리 사용에 과도한 오버헤드를 일으킬 수 있다.
* 2014년 1월에 출시된 0.13 버전을 기준으로 Pandas는 비용이 많이 드는 중간 배열의 할당 없이 속도가 빠른 C연산에 직접 접근할 수 있는 실험적인 도구

eval()

In [107]:
# 1. 테스트 셋을 만들어보자.
nrows, ncols = 100000, 100
rng = np.random.RandomState(42)
df1, df2, df3, df4 = (pd.DataFrame(rng.rand(nrows, ncols)) 
                      for i in range(4))

In [108]:
df1.head(2)

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.374540,0.950714,0.731994,0.598658,0.156019,0.155995,0.058084,0.866176,0.601115,0.708073,...,0.119594,0.713245,0.760785,0.561277,0.770967,0.493796,0.522733,0.427541,0.025419,0.107891
1,0.031429,0.636410,0.314356,0.508571,0.907566,0.249292,0.410383,0.755551,0.228798,0.076980,...,0.093103,0.897216,0.900418,0.633101,0.339030,0.349210,0.725956,0.897110,0.887086,0.779876

In [110]:
df2.head(2)

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,0.926538,0.382461,0.871469,0.761471,0.328826,0.988821,0.120738,0.358905,0.954462,0.004711,...,0.310465,0.816988,0.930747,0.111477,0.772517,0.801181,0.466825,0.005912,0.705110,0.487674
1,0.715167,0.490948,0.904532,0.319521,0.582585,0.980330,0.019068,0.089363,0.281105,0.143648,...,0.433028,0.132540,0.263659,0.339079,0.234842,0.507921,0.544545,0.197424,0.432392,0.218104

In [114]:
# 2. 네 개의 DataFrame 모두의 합을 계산해보자 (고전적인 방법)
%timeit df1 + df2 + df3 + df4

58.7 ms ± 3.26 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [113]:
# 3. eval를 사용해 계산해보자.
# 시간이 훨씬 빠르다.
%timeit pd.eval('df1 + df2 + df3 + df4') #SQL같다.

28.3 ms ± 665 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

query()

In [115]:
# 테스트 데이터 셋을 생성한다.
df = pd.DataFrame(rng.rand(1000, 3), columns=['A', 'B', 'C'])
df.head()

          A         B         C
0  0.615875  0.525167  0.047354
1  0.330858  0.412879  0.441564
2  0.689047  0.559068  0.230350
3  0.290486  0.695479  0.852587
4  0.424280  0.534344  0.245216

In [117]:
# 1-1. 0.5보다 작은 데이터를 찾는 고전적인 방법 즉 마스킹을 이용하는 방법
df[(df.A < 0.5) & (df.B < 0.5)].head()

           A         B         C
0   0.099772  0.365763  0.422644
5   0.372495  0.126174  0.624648
7   0.304463  0.087584  0.398856
24  0.409017  0.249659  0.913871
31  0.422093  0.147429  0.106137

In [118]:
# 1-2. 0.5보다 작은 데이터를 찾기 위해 Query를 사용
df.query('A < 0.5 and B < 0.5').head()

           A         B         C
0   0.099772  0.365763  0.422644
5   0.372495  0.126174  0.624648
7   0.304463  0.087584  0.398856
24  0.409017  0.249659  0.913871
31  0.422093  0.147429  0.106137

In [119]:
# 2-1 고전적인 방법
Cmean = df['C'].mean()
display(Cmean)

df[(df.A < Cmean) & (df.B < Cmean)].head()
# query 굳이 안사용해도...

0.49393366919790965

           A         B         C
0   0.099772  0.365763  0.422644
5   0.372495  0.126174  0.624648
7   0.304463  0.087584  0.398856
24  0.409017  0.249659  0.913871
31  0.422093  0.147429  0.106137